benchmarks/filter-orders.yaml
config:
  target: https://dj8fuebnckdnl.cloudfront.net
  phases:
    - duration: 10 # for how many seconds should the users be arriving
      arrivalRate: 500 # how many new users arrive each second
      name: 'Warm up the application'
  defaults:
    headers:
      authorization: 'Bearer a8043dc77ef4607bf594ed186cc7dfc7a1901e321186cec4'
  payload:
    path: '../tmp/prepared-records.csv'
    order: 'random'
    skipHeader: true
    fields:
      - 'Region'
      - 'Country'
      - 'ItemType'
      - 'SalesChannel'
      - 'OrderPriority'
      - 'OrderDate'
      - 'OrderID'
      - 'ShipDate'
      - 'UnitsSold'
      - 'UnitPrice'
      - 'UnitCost'
      - 'TotalRevenue'
      - 'TotalCost'
      - 'TotalProfit'
scenarios:
  - flow:
      - post:
          url: '/cms/preview/en-US'
          json:
            [
              {
                'query': "{\n  listOrders(where:{\n    orderId:{{ OrderID }}\n  }){\n    data{\n      id\n    }\n  }\n}",
              },
            ]