benchmarks/results/hc-write-data/test-e/statistics.json
{
  "GraphQL HTTP Request" : {
    "transaction" : "GraphQL HTTP Request",
    "sampleCount" : 3343666,
    "errorCount" : 49,
    "errorPct" : 0.0014654574,
    "meanResTime" : 429.2702955378935,
    "medianResTime" : 378.0,
    "minResTime" : 11.0,
    "maxResTime" : 30038.0,
    "pct1ResTime" : 549.0,
    "pct2ResTime" : 661.0,
    "pct3ResTime" : 758.0,
    "throughput" : 3977.3397456103935,
    "receivedKBytesPerSec" : 2278.337719606711,
    "sentKBytesPerSec" : 4353.428572041915
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3343666,
    "errorCount" : 49,
    "errorPct" : 0.0014654574,
    "meanResTime" : 429.2702955378935,
    "medianResTime" : 378.0,
    "minResTime" : 11.0,
    "maxResTime" : 30038.0,
    "pct1ResTime" : 549.0,
    "pct2ResTime" : 661.0,
    "pct3ResTime" : 758.0,
    "throughput" : 3977.3397456103935,
    "receivedKBytesPerSec" : 2278.337719606711,
    "sentKBytesPerSec" : 4353.428572041915
  }
}