benchmarks/insert-orders.yaml
config:
  target: https://dj8fuebnckdnl.cloudfront.net
  phases:
    - duration: 5 # for how many seconds should the users be arriving
      arrivalRate: 100 # how many new users arrive each second
      name: 'Warm up the application'
  defaults:
    headers:
      authorization: 'Bearer a8043dc77ef4607bf594ed186cc7dfc7a1901e321186cec4'
  payload:
    path: '../tmp/prepared-records.csv'
    order: 'random'
    skipHeader: true
    fields:
      - 'Region'
      - 'Country'
      - 'ItemType'
      - 'SalesChannel'
      - 'OrderPriority'
      - 'OrderDate'
      - 'OrderID'
      - 'ShipDate'
      - 'UnitsSold'
      - 'UnitPrice'
      - 'UnitCost'
      - 'TotalRevenue'
      - 'TotalCost'
      - 'TotalProfit'
scenarios:
  - flow:
      - post:
          url: '/cms/manage/en-US'
          json:
            [
              {
                'query': "mutation {\n  createOrder(data: {orderId: {{ OrderID }}, orderDate: \"{{ OrderDate }}\", shippingDate: \"{{ ShipDate }}\", unitsSold: {{ UnitsSold }}, unitPrice: {{ UnitPrice }}, totalPrice: {{ TotalRevenue }}, country: {modelId: \"country\", entryId: \"{{ Country }}\"}, itemType: {modelId: \"itemType\", entryId: \"{{ ItemType }}\"}, salesChannel: {modelId: \"salesChannel\", entryId: \"{{ SalesChannel }}\"}, orderPriority: {modelId: \"orderPriority\", entryId: \"{{ OrderPriority }}\"}}) {\n    data {\n      id\n    }\n    error {\n      message\n    }\n  }\n}\n",
              },
            ]